run/shockTube/galinstan/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 321.30;
    }
    
    outlet
    {
    	type		zeroGradient;
    }
    
    top
    {
    	type		zeroGradient;
    }
    
    bottom
    {
    	type		zeroGradient;
    }

    frontAndBack
    {
    	type		empty;
    }
}


// ************************************************************************* //
