run/shockTube/galinstan/0_orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 75144.49;

boundaryField
{
    inlet
    {
        type		waveTransmissive;
        field       p_rgh;
        psi         thermo:psi;
	    gamma		1.4;
        fieldInf    103421.4;
        lInf        1;
        value       uniform 103421.4;
    }
    
    outlet
    {
    	type		waveTransmissive;
        field       p_rgh;
        psi         thermo:psi;
	    gamma		1.4;
        fieldInf    75144.49;
        lInf        20;
        value       uniform 75144.49;
    }
    
    top
    {
    	type		zeroGradient;
    }
    
    bottom
    {
    	type		zeroGradient;
    }

    frontAndBack
    {
    	type		empty;
    }
}

// ************************************************************************* //
