run/shockTube/galinstan/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
    boxToCell
    {
    	min	(-1 -1 -1);
    	max	(-6.25e-4 1 1);
    	
    	fieldValues
    	(
    		volScalarFieldValue p_rgh 103421.4
    		volScalarFieldValue p 103421.4
            volScalarFieldValue T 321.30
            volScalarFieldValue k 1.0
            volScalarFieldValue nut 0.0001
    		volVectorFieldValue U (80 0 0)
    	);
    }
);


// ************************************************************************* //
