run/shockTube/galinstan/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
    	name		collectorPlane25_0mm;
    	type		faceZoneSet;
    	action		new;
    	source		planeToFaceZone;
    	point		(25.0e-3 0.0 0.0);
    	normal		(-1.0 0 0);
    	option		closest;
    }
);


// ************************************************************************* //
